pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/host/r_usb_hreg_access.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_usb_hreg_access.c
* Description  : USB IP register access code
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 04.01.2014 1.00 First Release
*         : 30.01.2015 1.01    Added RX71M.
***********************************************************************************************************************/


/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include "r_usb_basic_if.h"


#if (USB_FUNCSEL_USBIP0_PP == USB_HOST_PP) || (USB_FUNCSEL_USBIP1_PP == USB_HOST_PP)

/******************************************************************************
Constant macro definitions
******************************************************************************/
#define USB_DEVSEL_NUM_SHIFT    12

/************/
/*  SYSCFG  */
/************/
/******************************************************************************
Function Name   : usb_hreg_set_drpd
Description     : Set DRPD bit of specified port's SYSCFG register. This is only 
                : for when Host, to pull down the D+ and D- lines.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_drpd( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->SYSCFG.WORD |= USB_DRPD;
    }
} /* eof usb_hreg_set_drpd() */

/******************************************************************************
Function Name   : usb_hreg_clr_drpd
Description     : Clear DRPD-bit specified port's SYSCFG register. For 
                : host external circuit, to not pull down the D+ and D- lines.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_drpd( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->SYSCFG.WORD &= ~USB_DRPD;
    }
} /* eof usb_hreg_clr_drpd() */

/************/
/*  SYSSTS0 */
/************/
/* System Configuration Status Register 0 */

/**************/
/*  DVSTCTR0  */
/**************/
/* Device State Control Register 0 */

/******************************************************************************
Function Name   : usb_hreg_set_rwupe
Description     : Set the RWUPE-bit specified port's DVSTCTR0 reg-
                : ister. When host. To allow detection of remote wake-up from 
                : a USB Function.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_rwupe( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD |= USB_RWUPE;
    }
} /* eof usb_hreg_set_rwupe() */

/******************************************************************************
Function Name   : usb_hreg_clr_rwupe
Description     : Clear the RWUPE-bit specified port's DVSTCTR0 reg-
                : ister. When host. To prohibit detection of remote wake-up from 
                : a USB Function.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_rwupe( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD &= ~USB_RWUPE;
    }
} /* eof usb_hreg_clr_rwupe() */

/******************************************************************************
Function Name   : usb_hreg_set_resume
Description     : Set the RESUME-bit specified port's DVSTCTR0 register 
                : When host. To allow output of resume signal to a USB Function.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_resume( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD |= USB_RESUME;
    }
} /* eof usb_hreg_set_resume() */

