pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/host/r_usb_hreg_access.c
/******************************************************************************
Function Name   : usb_hreg_clr_resume
Description     : Clear the RESUME-bit specified port's DVSTCTR0 register 
                : When host. To prohibit output of resume signal to a USB Func-
                : tion.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_resume( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD &= ~USB_RESUME;
    }
} /* eof usb_hreg_clr_resume() */

/******************************************************************************
Function Name   : usb_hreg_set_uact
Description     : Set UACT-bit (USB Bus Enable) specified port's DVSTCTR0 
                : register. When Host, to output SOF.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_uact( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD |= USB_UACT;
    }
} /* eof usb_hreg_set_uact() */

/******************************************************************************
Function Name   : usb_hreg_clr_uact
Description     : Clear UACT-bit (USB Bus Enable) specified port's DVSTCTR0 
                : register. When Host, to prohibit output SOF.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_uact( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD &= ~USB_UACT;
    }
} /* eof usb_hreg_clr_uact() */

/**************/
/*  TESTMODE  */
/**************/

/************/
/*  PINCFG  */
/************/

/**********************************/
/*  DMA0CFG, DMA1CFG  for 597ASSP */
/**********************************/

/***************************/
/*  CFIFO, D0FIFO, D1FIFO  */
/***************************/

/**********************************/
/* CFIFOSEL, D0FIFOSEL, D1FIFOSEL */
/**********************************/

/**********************************/
/* CFIFOCTR, D0FIFOCTR, D1FIFOCTR */
/**********************************/

/*************/
/*  INTENB0  */
/*************/

/*************/
/*  INTENB1  */
/*************/
/* Interrupt Enable Register 1 */

/******************************************************************************
Function Name   : usb_hreg_read_intenb
Description     : Returns the value of the specified port's INTENB1 register.
                : uint16_t  port  : USB port number. //$REA - not used.
Return value    : INTENB1/INTENB2 content
******************************************************************************/
uint16_t    usb_hreg_read_intenb( USB_UTR_t *ptr, uint16_t port )
{
    return ptr->ipp->INTENB1.WORD;
} /* eof usb_hreg_read_intenb() */

/******************************************************************************
Function Name   : usb_hreg_write_intenb
Description     : Write the specified data to the specified port's INTENB register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_write_intenb( USB_UTR_t *ptr, uint16_t port, uint16_t data )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD = data;
    }
} /* eof usb_hreg_write_intenb() */

/******************************************************************************
Function Name   : usb_hreg_set_enb_ovrcre
Description     : Set specified port's OVRCRE-bit (Overcurrent Input Change Int-
                : errupt Status Enable) in the INTENB1 register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_enb_ovrcre( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD |= USB_OVRCRE;
    }
} /* eof usb_hreg_set_enb_ovrcre() */

/******************************************************************************
Function Name   : usb_hreg_clr_enb_ovrcre
Description     : Clear the OVRCRE-bit of the specified port's INTENB1 register,
                : to prohibit VBUS interrupts.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_enb_ovrcre( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD &= ~USB_OVRCRE;
    }
} /* eof usb_hreg_clr_enb_ovrcre() */

/******************************************************************************
Function Name   : usb_hreg_set_enb_bchge
Description     : The BCHGE-bit (USB Bus Change Interrupt Enable) is set in the 
                : specified port's INTENB1 register. This will cause a BCHG 
                : interrupt when a change of USB bus state has been detected.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_enb_bchge( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD |= USB_BCHGE;
    }
} /* eof usb_hreg_set_enb_bchge() */

