pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/host/r_usb_hreg_access.c
/******************************************************************************
Function Name   : usb_hreg_clr_enb_bchge
Description     : The BCHGE-bit (USB Bus Change Interrupt Enable) is cleared in 
                : the specified port's INTENB1 register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_enb_bchge( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD &= ~USB_BCHGE;
    }
} /* eof usb_hreg_clr_enb_bchge() */

/******************************************************************************
Function Name   : usb_hreg_set_enb_dtche
Description     : Enable the specified port's DTCHE-interrupt "Disconnection 
                : Detection" by setting the DTCHE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_enb_dtche( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD |= USB_DTCHE;
    }
} /* eof usb_hreg_set_enb_dtche() */

/******************************************************************************
Function Name   : usb_hreg_clr_enb_dtche
Description     : Disable the specified port's DTCHE-interrupt "Disconnection 
                : Detection" by clearing the DTCHE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_enb_dtche( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD &= ~USB_DTCHE;
    }
} /* eof usb_hreg_clr_enb_bchge() */

/******************************************************************************
Function Name   : usb_hreg_set_enb_attche
Description     : Enable the specified port's ATTCHE-interrupt "Connection 
                : Detection" by setting the ATTCHE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_set_enb_attche( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD |= USB_ATTCHE;
    }
} /* eof usb_hreg_set_enb_attche() */

/******************************************************************************
Function Name   : usb_hreg_clr_enb_attche
Description     : Disable the specified port's ATTCHE-interrupt "Disconnection 
                : Detection" by clearing the ATTCHE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_enb_attche( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTENB1.WORD &= ~USB_ATTCHE;
    }
} /* eof usb_hreg_clr_enb_attche() */

/******************************************************************************
Function Name   : usb_hreg_set_enb_signe
Description     : Enable the SIGNE-interrupt "Setup Transaction
                : Error" by setting the SIGNE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_set_enb_signe( USB_UTR_t *ptr )
{
    ptr->ipp->INTENB1.WORD |= USB_SIGNE;
} /* eof usb_hreg_set_enb_signe() */

/******************************************************************************
Function Name   : usb_hreg_clr_enb_signe
Description     : Disable the SIGNE-interrupt "Setup Transac-
                : tion Error" by clearing the SIGNE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_enb_signe( USB_UTR_t *ptr )
{
    ptr->ipp->INTENB1.WORD &= ~USB_SIGNE;
} /* eof usb_hreg_clr_enb_signe() */

/******************************************************************************
Function Name   : usb_hreg_set_enb_sacke
Description     : Enable the SACKE-interrupt "Setup Transaction 
                : Normal Response" by setting the SACKE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_set_enb_sacke( USB_UTR_t *ptr )
{
    ptr->ipp->INTENB1.WORD |= USB_SACKE;
} /* eof usb_hreg_set_enb_sacke() */

/******************************************************************************
Function Name   : usb_hreg_clr_enb_sacke
Description     : Disable the SACKE-interrupt "Setup Transac-
                : tion Normal Response" by clearing the SACKE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_enb_sacke( USB_UTR_t *ptr )
{
    ptr->ipp->INTENB1.WORD &= ~USB_SACKE;
} /* eof usb_hreg_clr_enb_sacke() */

/******************************************************************************
Function Name   : usb_hreg_set_enb_pddetinte
Description     : Enable the PDDETINT-interrupt "Connection Detection for 
                : Battery Charging Supporting Device" by setting 
                : the PDDETINTE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_set_enb_pddetinte( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->INTENB1.WORD |= USB_PDDETINTE;
    }
} /* eof usb_hreg_set_enb_pddetinte() */

