pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/host/r_usb_hreg_access.c
/******************************************************************************
Function Name   : usb_hreg_clr_enb_pddetinte
Description     : Disable the PDDETINT-interrupt "Connection Detection for 
                : Battery Charging Supporting Device" by clearing 
                : the PDDETINTE-bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_enb_pddetinte( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->INTENB1.WORD &= ~USB_PDDETINTE;
    }
} /* eof usb_hreg_clr_enb_pddetinte() */

/*************/
/*  BRDYENB  */
/*************/

/*************/
/*  NRDYENB  */
/*************/

/*************/
/*  BEMPENB  */
/*************/

/*************/
/*  SOFCFG   */
/*************/
/* SOF Output Configuration */

/******************************************************************************
Function Name   : usb_hreg_set_trnensel
Description     : When host, set the TRNENSEL-bit; "Transac-
                : tion-Enabled Time Select" for low-speed USB communication.
                : This bit should be set to 0 if USB Function.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_set_trnensel( USB_UTR_t *ptr )
{
    ptr->ipp->SOFCFG.WORD |= USB_TRNENSEL;
} /* eof usb_hreg_set_trnensel() */

/******************************************************************************
Function Name   : usb_hreg_clr_trnensel
Description     : When host, clear the TRNENSEL-bit; "Transac-
                : tion-Enabled Time Select" for non low-speed communication.
                : This bit should be set to 0 if USB Function.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_trnensel( USB_UTR_t *ptr )
{
    ptr->ipp->SOFCFG.WORD &= ~USB_TRNENSEL;
} /* eof usb_hreg_clr_trnensel() */

/*************/
/*  INTSTS0  */
/*************/

/*************/
/*  INTSTS1  */
/*************/
/* Interrupt Status Register 1  */

/******************************************************************************
Function Name   : usb_hreg_read_intsts
Description     : Returns the value of the specified port's INTSTS1 register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : INTSTS1 content
******************************************************************************/
uint16_t    usb_hreg_read_intsts( USB_UTR_t *ptr, uint16_t port )
{
    return (uint16_t)(ptr->ipp->INTSTS1.WORD);
} /* eof usb_hreg_read_intsts() */

/******************************************************************************
Function Name   : usb_hreg_write_intsts
Description     : Write the specified data to the specified port's INTSTS1 reg-
                : ister.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_write_intsts( USB_UTR_t *ptr, uint16_t port, uint16_t data )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTSTS1.WORD = data;
    }
} /* eof usb_hreg_write_intsts() */

/******************************************************************************
Function Name   : usb_hreg_clr_sts_ovrcr
Description     : Clear the specified port's OVRCR-bit; "Overcurrent 
                : Input Change Interrupt Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_ovrcr( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTSTS1.WORD = (uint16_t)~USB_OVRCR;
    }
} /* eof usb_hreg_clr_sts_ovrcr() */

/******************************************************************************
Function Name   : usb_hreg_clr_sts_bchg
Description     : Clear the specified port's BCHG-bit; "USB Bus Change Interrupt 
                : Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_bchg( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTSTS1.WORD = (uint16_t)~USB_BCHG;
    }
} /* eof usb_hreg_clr_sts_bchg() */

/******************************************************************************
Function Name   : usb_hreg_clr_sts_dtch
Description     : Clear the specified port's DTCH-bit; "USB Disconnection Detec-
                : tion Interrupt Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_dtch( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTSTS1.WORD = (uint16_t)~USB_DTCH;
    }
} /* eof usb_hreg_clr_sts_dtch() */

/******************************************************************************
Function Name   : usb_hreg_clr_sts_attch
Description     : Clear the specified port's ATTCH-bit; "ATTCH Interrupt Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_attch( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTSTS1.WORD = (uint16_t)~USB_ATTCH;
    }
} /* eof usb_hreg_clr_sts_attch() */

