pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/host/r_usb_hreg_access.c
/******************************************************************************
Function Name   : usb_hreg_clr_sts_eoferr
Description     : Clear the specified port's EOFERR-bit; "EOF Error Detection 
                : Interrupt Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_eoferr( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->INTSTS1.WORD = (uint16_t)~USB_EOFERR;
    }
} /* eof usb_hreg_clr_sts_eoferr() */

/******************************************************************************
Function Name   : usb_hreg_clr_sts_sign
Description     : Clear the SIGN-bit; "Setup Transaction Error
                : Interrupt Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_sign( USB_UTR_t *ptr )
{
    ptr->ipp->INTSTS1.WORD = (uint16_t)~USB_SIGN;
} /* eof usb_hreg_clr_sts_sign() */

/******************************************************************************
Function Name   : usb_hreg_clr_sts_sack
Description     : Clear the SACK-bit; "Setup Transaction Normal
                : Response Interrupt Status".
                : Interrupt Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_sack( USB_UTR_t *ptr )
{
    ptr->ipp->INTSTS1.WORD = (uint16_t)~USB_SACK;
} /* eof usb_hreg_clr_sts_sack() */

/******************************************************************************
Function Name   : usb_hreg_clr_sts_pddetint
Description     : Clear the PDDETINT-bit; "
                : ".
                : Interrupt Status".
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_sts_pddetint( USB_UTR_t *ptr, uint16_t port )
{
    if(port == USB_PORT0)
    {
        if(ptr->ip == USB_USBIP_1)
        {
            ptr->ipp1->INTSTS1.WORD = (uint16_t)~USB_PDDETINT;
        }
    }
} /* eof usb_hreg_clr_sts_sack() */

/************/
/* BRDYSTS  */
/************/

/************/
/* NRDYSTS  */
/************/

/************/
/* BEMPSTS  */
/************/

/************/
/* FRMNUM   */
/************/

/************/
/* USBADDR  */
/************/

/************/
/* USBREQ   */
/************/
/* USB Request Type */

/******************************************************************************
Function Name   : usb_hreg_write_usbreq
Description     : Write bRequest and bmRequestType to USBREQ register.
                : When Host, the values of bRequest and bmRequestType 
                : to be transmitted are written. (When Function, the received 
                : values of bRequest and bmRequestType are stored in USBREQ).
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_write_usbreq( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->USBREQ.WORD = data;
} /* eof usb_hreg_write_usbreq() */

/************/
/* USBVAL   */
/************/
/* USB Request Value Register */

/******************************************************************************
Function Name   : usb_hreg_set_usbval
Description     : Write the specified 'wValue' to USBVAL register,
                : to write the USB request. When Host, the value of 
                : wValue to be transmitted is set. (When Function, the value of 
                : wValue that has been received is stored in USBREQ.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_set_usbval( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->USBVAL = data;
} /* eof usb_hreg_set_usbval() */

/************/
/* USBINDX  */
/************/
/* USB Request Index */

/******************************************************************************
Function Name   : usb_hreg_set_usbindx
Description     : Write the specified 'wIndex', the USB request, to USBINDX
                : register, for host setup requests for control 
                : transfers.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_set_usbindx( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->USBINDX = data;
} /* eof usb_hreg_set_usbindx() */

/************/
/* USBLENG  */
/************/
/* USB Request Length */

/******************************************************************************
Function Name   : usb_hreg_set_usbleng
Description     : Write the specified 'wLength' value to USBINDX register, 
                : for host setup requests for control.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_set_usbleng( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->USBLENG = data;
} /* eof usb_hreg_set_usbleng() */

/************/
/* DCPCFG   */
/************/

/************/
/* DCPMAXP  */
/************/

/************/
/* DCPCTR   */
/************/
/******************************************************************************
Function Name   : usb_hreg_write_dcpctr
Description     : Write the specified data value to the DCPCTR register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_write_dcpctr( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->DCPCTR.WORD = data;
} /* eof usb_hreg_write_dcpctr() */

