pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/host/r_usb_hreg_access.c
/******************************************************************************
Function Name   : usb_hreg_set_sureq
Description     : Set te SUREQ-bit in the DCPCTR register 
                : (Set SETUP packet send when HostController function is selected)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_set_sureq( USB_UTR_t *ptr )
{
    ptr->ipp->DCPCTR.WORD |= USB_SUREQ;
} /* eof usb_hreg_set_sureq() */

/******************************************************************************
Function Name   : usb_hreg_set_sureqclr
Description     : Set the SUREQCLR-bit in the DCPCTR register.
                : (Disable SETUP packet send setting when HostController func-
                :  tion is selected)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_set_sureqclr( USB_UTR_t *ptr )
{
    ptr->ipp->DCPCTR.WORD |= USB_SUREQCLR;
} /* eof usb_hreg_set_sureqclr() */

/************/
/* PIPESEL  */
/************/

/************/
/* PIPECFG  */
/************/

/************/
/* PIPEBUF  */
/************/

/************/
/* PIPEMAXP */
/************/
/******************************************************************************
Function Name   : usb_hreg_set_devsel
Description     : Write the address specified by the argument to the DEVSEL-bit 
                : of the PIPEMAXP register. (Set the address of the USB Device 
                : when HostController function is selected.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_set_devsel( USB_UTR_t *ptr, uint16_t data )
{
    volatile uint16_t *reg_p;
    
    reg_p = (uint16_t *)&ptr->ipp->PIPEMAXP;
    *reg_p &= ~USB_DEVSEL;
    *reg_p |= data << USB_DEVSEL_NUM_SHIFT;
} /* eof usb_hreg_set_devsel() */

/************/
/* PIPEPERI */
/************/

/********************/
/* DCPCTR, PIPEnCTR */
/********************/

/************/
/* PIPEnTRE */
/************/

/************/
/* PIPEnTRN */
/************/

/************/
/* DEVADDn  */
/************/
/******************************************************************************
Function Name   : usb_hreg_read_devadd
Description     : Return the DEVADD register value for the specified USB device 
                ; address.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  devsel      ; USB device address value 
Return value    : DEVADDx content
******************************************************************************/
uint16_t    usb_hreg_read_devadd( USB_UTR_t *ptr, uint16_t devsel )
{
    volatile uint16_t    *reg_p;
    uint16_t    devadr;
    uint16_t    return_value;

    devadr = devsel >> USB_DEVADDRBIT;

    if(devadr > USB_MAXDEVADDR)
    {
        return USB_ERROR;
    }
    else
    {
        reg_p = (uint16_t *)&(ptr->ipp->DEVADD0) + devadr;
        return_value = (*reg_p & (USB_UPPHUB | USB_HUBPORT | USB_USBSPD));
        return return_value;
    }
} /* eof usb_hreg_read_devadd() */

/******************************************************************************
Function Name   : usb_hreg_rmw_devadd
Description     : Read-modify-write the specified devsel's DEVADD.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  devsel: Device address
                : uint16_t  data  : The value to write.
                : uint16_t  width : Bit pattern to read-modify-write.
Return value    : none
******************************************************************************/
void    usb_hreg_rmw_devadd( USB_UTR_t *ptr, uint16_t devsel, uint16_t data, uint16_t width )
{
    volatile uint16_t    *reg_p;
    uint16_t    buf;
    uint16_t    devadr;

    devadr = devsel >> USB_DEVADDRBIT;

    reg_p = (uint16_t *)&(ptr->ipp->DEVADD0) + devadr;

    buf = *reg_p;
    buf &= ~width;
    buf |= (data & width);
    *reg_p = buf;
} /* eof usb_hreg_rmw_devadd() */

/******************************************************************************
Function Name   : usb_hreg_set_usbspd
Description     : Set the DEVADD register's USBSPD for the specified device add-
                : ress.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  devsel      ; USB device address value
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_hreg_set_usbspd( USB_UTR_t *ptr, uint16_t devsel, uint8_t data )
{
    volatile uint16_t    *reg_p;
    uint16_t    devadr;

    devadr = devsel >> USB_DEVADDRBIT;

    reg_p = (uint16_t *)&(ptr->ipp->DEVADD0) + devadr;

    *reg_p &= ~USB_USBSPD;
    *reg_p |= data;
} /* eof usb_hreg_set_usbspd() */


/************/
/* PHYSLEW  */
/************/

/******************************************************************************
Function Name   : usb_hreg_write_physlew
Description     : Set the PHYSLEW register's for host mode
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_write_physlew( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_0)
    {
        ptr->ipp->PHYSLEW.LONG = 0x0000000E;
    }
} /* eof usb_hreg_write_physlew() */


/************/
/* BCCTRL   */
/************/

/******************************************************************************
Function Name   : usb_hreg_set_dcpmode
Description     : Set DCPMODE bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_set_dcpmode( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->BCCTRL.WORD |= USB_DCPMODE;
    }
} /* eof usb_hreg_set_dcpmode() */

/******************************************************************************
Function Name   : usb_hreg_clr_dcpmode
Description     : Clear DCPMODE bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_hreg_clr_dcpmode( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->BCCTRL.WORD &= ~USB_DCPMODE;
    }
} /* eof usb_hreg_clr_dcpmode() */

#endif  /* (USB_FUNCSEL_USBIP0_PP == USB_HOST_PP) || (USB_FUNCSEL_USBIP1_PP == USB_HOST_PP) */

/******************************************************************************
End of file
******************************************************************************/
